---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarHandlesData.GetStartHandle
source: html/741d559f-701c-ee7a-c717-72c9e0429614.htm
---
# Autodesk.Revit.DB.Structure.RebarHandlesData.GetStartHandle Method

Gets the start handle tag.

## Syntax (C#)
```csharp
public int GetStartHandle()
```

## Returns
Returns the start handle tag.